Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.oauth_integration will be created
+ resource "aws_apigatewayv2_integration" "oauth_integration" {
      + api_id                                    = "1aajeoktfa"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.instagram_auth_callback will be created
+ resource "aws_apigatewayv2_route" "instagram_auth_callback" {
      + api_id             = "1aajeoktfa"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /instagram/auth/callback"
      + target             = (known after apply)
    }

  # aws_lambda_function.instagram_oauth will be created
+ resource "aws_lambda_function" "instagram_oauth" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/instagram_oauth/instagram_oauth.zip"
      + function_name                  = "sharedservices-instagram-oauth"
      + handler                        = "instagram_oauth.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "E5n7oZqGmUW2SsObTfiFAP40wxAZMfy34/8dmwXIqZ0="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "INSTAGRAM_APP_ID"     = "985256750363339"
              + "INSTAGRAM_APP_SECRET" = "634d49e8c6f2986886c20b829a031394"
              + "REDIRECT_URI"         = "https://https://1aajeoktfa.execute-api.us-east-2.amazonaws.com/instagram/auth/callback"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.allow_apigw_oauth will be created
+ resource "aws_lambda_permission" "allow_apigw_oauth" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sharedservices-instagram-oauth"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-2:825765422855:1aajeoktfa/*/GET/instagram/auth/callback"
      + statement_id        = "AllowHttpApiInvokeOAuth"
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```